import React from "react";
import { FaSignInAlt, FaBars, FaTimes } from "react-icons/fa";
import { Link, NavLink } from "react-router-dom";
const HamburgerMenu = () => {
  return (
    <div className="flex md:hidden  justify-center items-center mr-[5px] z-50">
      {/* چک‌باکس */}
      <input type="checkbox" id="menu-toggle" className="hidden peer" />
      <label htmlFor="menu-toggle" className="cursor-pointer ">
        {/* آیکون همبرگر */}
        <FaBars className="w-[16px] h-auto sm:w-[22px]  dark:text-gray-200 text-[#263238] " />
      </label>

      {/* منو */}
      <div className="fixed top-0 right-0 w-48 h-full bg-gray-800 dark:bg-gray-950 text-white transform translate-x-full transition-transform duration-300 peer-checked:translate-x-0">
        <div className="flex justify-between items-center p-2">
          <Link className="flex gap-x-1 items-center" to={"/"}>
            <span className="xl:w-[44px] lg:w-[40px] w-[20px] sm:w-[28px] xl:h-[32px] lg:h-[30px] sm:h-[26px] h-[20px] flex items-center">
              <svg
                viewBox="0 0 44 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M27.7511 29.7527H25.2471V27.759C25.2471 27.4144 25.013 27.1313 24.728 27.1313H20.5241C20.2391 27.1313 20.005 27.4144 20.005 27.759V29.7527H17.501C17.1957 29.7527 16.9106 29.8635 16.6562 30.0973L15.3126 31.3403H29.9091L28.5654 30.0973C28.3517 29.8635 28.0667 29.7527 27.7511 29.7527Z"
                  fill="#64B5F6"
                />
                <path
                  d="M13.4313 19.7283C17.7776 19.7283 22.8008 18.4361 27.5925 16.0886C31.7428 14.0641 35.2519 11.3935 37.6745 8.59376V4.50176C37.6745 2.43422 36.3029 0.775879 34.5929 0.775879H10.6882C8.97815 0.775879 7.60657 2.43422 7.60657 4.50176V18.673C9.15628 19.3622 11.1157 19.7283 13.4313 19.7283Z"
                  fill="#1565C0"
                />
                <path
                  d="M26.6862 21.7956C21.663 24.2723 16.3192 25.6076 11.5988 25.6076C10.2629 25.6076 9.01599 25.4784 7.87598 25.2846C8.33911 26.6199 9.40787 27.5459 10.726 27.5459H34.6307C36.3407 27.5459 37.7123 25.8876 37.7123 23.8201V13.5039C35.0226 16.6483 31.2107 19.5773 26.6862 21.7956Z"
                  fill="#1565C0"
                />
                <path
                  d="M13.4307 19.7282C17.777 19.7282 22.8002 18.436 27.5918 16.0885C30.2281 14.7962 32.6506 13.2241 34.6457 11.5657V5.64308C34.6457 4.99697 34.2182 4.43701 33.6482 4.43701H11.6316C11.0972 4.43701 10.6341 4.9539 10.6341 5.64308V19.5128C11.4891 19.642 12.4332 19.7282 13.4307 19.7282Z"
                  fill="#2196F3"
                />
                <path
                  d="M26.6838 21.7959C24.9381 22.6358 23.2103 23.3681 21.429 23.9496H33.6842C34.2186 23.9496 34.6817 23.4327 34.6817 22.7435V16.584C32.4017 18.5223 29.6941 20.3314 26.6838 21.7959Z"
                  fill="#2196F3"
                />
                <path
                  d="M30.561 6.61182H32.1997C32.36 6.61182 32.5025 6.78411 32.5025 6.97794V8.95933C32.5025 9.28239 32.1641 9.45468 32.0038 9.19624L30.365 7.21485C30.1691 7.02102 30.2938 6.61182 30.561 6.61182Z"
                  fill="#FCFCFC"
                />
                <path
                  d="M32.0378 12.1684C31.7707 12.4914 31.3432 12.4914 31.076 12.1684L27.7984 8.20557C27.5312 7.88252 27.5312 7.36564 27.7984 7.04258C28.0656 6.71953 28.4931 6.71953 28.7603 7.04258L32.0378 11.0054C32.3407 11.3069 32.3407 11.8453 32.0378 12.1684Z"
                  fill="white"
                />
                <path
                  d="M27.9469 17.2371C17.6764 22.283 6.9072 22.1845 3.92479 17.0033C2.12313 13.902 3.52781 9.69297 7.14131 5.71782V4.93018C1.28846 9.85296 -1.34786 15.748 1.05435 19.9324C4.32176 25.5936 15.6305 25.9259 26.3183 20.6708C33.6674 17.0648 38.8078 11.7482 40.2226 6.96082C37.9731 10.6529 33.6267 14.4435 27.9469 17.2371Z"
                  fill="#2196F3"
                />
                <path
                  opacity="0.41"
                  d="M37.9514 9.96362C35.5186 12.6465 32.0985 15.2187 27.9456 17.2493C17.6751 22.2952 6.90584 22.1967 3.92344 17.0155C2.12178 13.9142 3.52646 9.70518 7.13996 5.73003V4.94238C6.77352 5.23775 6.42744 5.54542 6.09154 5.86541C2.19303 10.1605 0.696736 14.8372 2.70197 18.3077C5.96939 23.969 17.2781 24.3012 27.9659 19.0462C31.2537 17.4216 34.1038 15.4648 36.3838 13.3603C37.9717 11.6005 39.1525 9.80363 39.865 8.04374C39.2746 8.65909 38.6436 9.31136 37.9514 9.96362Z"
                  fill="#1565C0"
                />
                <path
                  d="M44 4.12974L41.8218 5.2866L42.0559 8.15412L40.468 6.0004L38.2897 7.15726L39.4806 4.65894L37.9131 2.50522L40.2237 3.13288L41.4248 0.65918L41.6589 3.5267L44 4.12974Z"
                  fill="#64B5F6"
                />
              </svg>
            </span>
            <span className="sm:text-sm text-xs">اسکریپت گاردین</span>
          </Link>
          <label
            htmlFor="menu-toggle"
            className="cursor-pointer text-white text-lg"
          >
            <FaTimes /> {/* آیکون بستن */}
          </label>
        </div>
        <ul className="space-y-2 p-2">
          <li>
            <NavLink
              to="/Courses"
              className="block text-white hover:bg-gray-600 p-1 text-sm"
            >
              دوره ها
            </NavLink>
          </li>
          <li>
            <NavLink
              to=""
              className="block text-white hover:bg-gray-600 p-1 text-sm"
            >
              اساتید
            </NavLink>
          </li>
          <li>
            <a
              href="#"
              className="block text-white hover:bg-gray-600 p-1 text-sm"
            >
              ارتباط با ما
            </a>
          </li>
          <li>
            <NavLink
              to="/News"
              className="block text-white hover:bg-gray-600 p-1 text-sm"
            >
              اخبار مقالات
            </NavLink>
          </li>
        </ul>
      </div>
    </div>
  );
};

export { HamburgerMenu };
